; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v6)
		(pred_1 ?v1)
		(pred_5 ?v8)
		(pred_2 ?v8)
		(pred_3 ?v1 ?v8)
		(pred_6)
		(pred_4 ?v1))

   (:action op_2
       :parameters  (?v4 ?v3)
       :precondition (and (not-eq ?v4 ?v3) 
                          (pred_5 ?v4) (pred_5 ?v3) (pred_2 ?v4))
       :effect (and  (pred_2 ?v3)
		     (not (pred_2 ?v4))))


   (:action op_3
       :parameters (?v7 ?v5)
       :precondition  (and  (pred_1 ?v7) (pred_5 ?v5)
			    (pred_3 ?v7 ?v5) (pred_2 ?v5) (pred_6))
       :effect (and (pred_4 ?v7)
		    (not (pred_3 ?v7 ?v5)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v7  ?v5)
       :precondition  (and  (pred_1 ?v7) (pred_5 ?v5)
			    (pred_4 ?v7) (pred_2 ?v5))
       :effect (and (pred_3 ?v7 ?v5)
		    (pred_6)
		    (not (pred_4 ?v7)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_02 obj_03 obj_01 
          obj_04 obj_05 
)
(:init
(pred_5 obj_02)
(pred_5 obj_03)
(pred_5 obj_01)
(pred_1 obj_04)
(pred_1 obj_05)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(pred_6)
(pred_3 obj_04 obj_01)
(pred_3 obj_05 obj_03)
(pred_2 obj_02)
)
(:goal
(and
(pred_3 obj_04 obj_01)
(pred_3 obj_05 obj_02)
)
)

(:constraints
  (sometime-before  (pred_3 obj_05 obj_02) (pred_2 obj_01))
)
)

; plan
1. (op_2 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_01)
   goals met: 1 of 2
2. (op_3 obj_04 obj_01)
   deleted: (pred_3 obj_04 obj_01) (pred_6)
   added: (pred_4 obj_04)
   goals met: 0 of 2
3. (op_2 obj_01 obj_03)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_03)
   goals met: 0 of 2
4. (op_1 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_3 obj_04 obj_03) (pred_6)
   goals met: 0 of 2
5. (op_3 obj_05 obj_03)
   deleted: (pred_3 obj_05 obj_03) (pred_6)
   added: (pred_4 obj_05)
   goals met: 0 of 2
6. (op_2 obj_03 obj_02)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_02)
   goals met: 0 of 2
7. (op_1 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_3 obj_05 obj_02) (pred_6)
   goals met: 1 of 2
8. (op_2 obj_02 obj_03)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_03)
   goals met: 1 of 2
9. (op_3 obj_04 obj_03)
   deleted: (pred_3 obj_04 obj_03) (pred_6)
   added: (pred_4 obj_04)
   goals met: 1 of 2
10. (op_2 obj_03 obj_01)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_01)
   goals met: 1 of 2
11. (op_1 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_3 obj_04 obj_01) (pred_6)
   goals met: 2 of 2
